In [1]:
import numpy as np
import pandas as pd

In [2]:
df1 = pd.read_csv(r'f:/test/apply_demo.csv')

In [3]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3989 entries, 0 to 3988
Data columns (total 2 columns):
time    3989 non-null int64
data    3989 non-null object
dtypes: int64(1), object(1)
memory usage: 46.8+ KB

In [4]:
df1.head()

         time                                data
0  1473411962   Symbol: APPL Seqno: 0 Price: 1623
1  1473411962   Symbol: APPL Seqno: 0 Price: 1623
2  1473411963   Symbol: APPL Seqno: 0 Price: 1623
3  1473411963   Symbol: APPL Seqno: 0 Price: 1623
4  1473411963   Symbol: APPL Seqno: 1 Price: 1649

In [5]:
df1.size

7978

In [6]:
s1 = pd.Series(['a']*3989)

In [7]:
df1['A'] = s1

In [8]:
df1.tail()

            time                                  data  A
3984  1473412961   Symbol: APPL Seqno: 998 Price: 1680  a
3985  1473412961   Symbol: APPL Seqno: 999 Price: 1509  a
3986  1473412961   Symbol: APPL Seqno: 999 Price: 1509  a
3987  1473412961   Symbol: APPL Seqno: 999 Price: 1509  a
3988  1473412962   Symbol: APPL Seqno: 999 Price: 1509  a

# apply
* Series
* ~~DataFrame~~

In [9]:
df1['A'] = df1['A'].apply(str.upper)

In [10]:
df1.size

11967

* 将一列拆分开

In [11]:
df1['data'][0].strip().split(' ')

['Symbol:', 'APPL', 'Seqno:', '0', 'Price:', '1623']

In [12]:
def foo(line):
    item = line.strip().split(' ')
    return pd.Series([item[1],item[3],item[5]])

In [13]:
df_tmp = df1['data'].apply(foo)

In [14]:
df_tmp = df_tmp.rename(columns={0:'Symbol',1:'Seqno',2:'Price'})

In [15]:
df_tmp.tail()

     Symbol Seqno Price
3984   APPL   998  1680
3985   APPL   999  1509
3986   APPL   999  1509
3987   APPL   999  1509
3988   APPL   999  1509

In [16]:
df1.tail()

            time                                  data  A
3984  1473412961   Symbol: APPL Seqno: 998 Price: 1680  A
3985  1473412961   Symbol: APPL Seqno: 999 Price: 1509  A
3986  1473412961   Symbol: APPL Seqno: 999 Price: 1509  A
3987  1473412961   Symbol: APPL Seqno: 999 Price: 1509  A
3988  1473412962   Symbol: APPL Seqno: 999 Price: 1509  A

In [17]:
df_new = df1.combine_first(df_tmp)

In [18]:
df_new.head()

   A   Price  Seqno Symbol                                data        time
0  A  1623.0    0.0   APPL   Symbol: APPL Seqno: 0 Price: 1623  1473411962
1  A  1623.0    0.0   APPL   Symbol: APPL Seqno: 0 Price: 1623  1473411962
2  A  1623.0    0.0   APPL   Symbol: APPL Seqno: 0 Price: 1623  1473411963
3  A  1623.0    0.0   APPL   Symbol: APPL Seqno: 0 Price: 1623  1473411963
4  A  1649.0    1.0   APPL   Symbol: APPL Seqno: 1 Price: 1649  1473411963

# del
* 删除某列

In [19]:
del df_new['data']

In [20]:
df_new.tail()

      A   Price  Seqno Symbol        time
3984  A  1680.0  998.0   APPL  1473412961
3985  A  1509.0  999.0   APPL  1473412961
3986  A  1509.0  999.0   APPL  1473412961
3987  A  1509.0  999.0   APPL  1473412961
3988  A  1509.0  999.0   APPL  1473412962